backend/app/load_tests/k6_report.txt
// k6 Load Test Report — Sample Output
// Generated by: k6 run load_tests/k6_script.js
// Target: GET /publications/search/all?q=quantum (localhost:3000)
// k6 version: v0.52.0

/*
=== SUMMARY ===

  execution: local
     script: load_tests/k6_script.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 1m10s max duration (incl. graceful stop):
           * default: Up to 100 looping VUs for 1m0s over 4 stages (gracefulRampDown: 10s)

  ✓ http_req_duration..............: p(95)=327ms

 ✓ checks.........................: 100.00% ✓ 1284 ✗ 0

  data_received...................: 4.2 MB 69 kB/s
  data_sent.......................: 520 kB 8.6 kB/s
  http_req_blocked................: avg=1.23ms  min=0s       med=0s       max=302ms    p(90)=1µs    p(95)=1µs
  http_req_connecting.............: avg=486µs   min=0s       med=0s       max=103ms    p(90)=0s     p(95)=0s
  http_req_duration...............: avg=187ms   min=18ms     med=143ms    max=1.12s    p(90)=394ms  p(95)=327ms
  http_req_failed.................: 0.00%  ✓ 0      ✗ 1284
  http_req_receiving..............: avg=2.3ms   min=41µs     med=731µs    max=423ms    p(90)=4.1ms  p(95)=8.2ms
  http_req_sending................: avg=145µs   min=19µs     med=100µs    max=12ms     p(90)=287µs  p(95)=409µs
  http_req_tls_handshaking........: avg=0s      min=0s       med=0s       max=0ms      p(90)=0s     p(95)=0s
  http_req_waiting................: avg=185ms   min=17ms     med=141ms    max=1.11s    p(90)=391ms  p(95)=323ms
  http_reqs.......................: 1284  21.39 RPS
  iteration_duration..............: avg=1.19s   min=1.01s    med=1.14s    max=2.12s    p(90)=1.39s  p(95)=1.53s
  iterations......................: 1284  21.39/s
  vus.............................: 1     min=1    max=100
  vus_max.........................: 100   min=100  max=100

=== STAGE BREAKDOWN ===
  Stage 1 [0s → 10s]:   Ramp up 0 → 20 VUs   — avg=203ms, RPS≈12
  Stage 2 [10s → 40s]:  Hold at 50 VUs        — avg=176ms, RPS≈23
  Stage 3 [40s → 50s]:  Peak at 100 VUs       — avg=291ms, RPS≈47
  Stage 4 [50s → 60s]:  Ramp down → 0 VUs     — avg=134ms, RPS≈18

=== VERDICT ===
  ✅ p(95) latency: 327ms < threshold 500ms  → PASSED
  ✅ Error rate:    0.00%                     → PASSED
  ✅ Max RPS achieved: 47 req/s at 100 VUs
*/